{
	"version":2,
	"filename":"index.html",
	"path_from_doc_root":"/blog/2019/2/9/empires/",
	"category":"blog post",
	"tags":[],
	"create_date":"2019-02-09",
	"title":"Empires",
	"title_plain":"empires",
	"excerpt":"I am about to leave London today and I’ve still got some time to kill while waiting for my flight back home. Thinking about the immense volume of the Harry ...",
	"content":"<a href=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/9/Empires.jpg\"><img src=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/9/Empires-w800.jpg\" width=\"800\"></a><p>I am about to leave London today and I’ve still got some time to kill while waiting for my flight back home. Thinking about the immense volume of the Harry Potter franchise (there is a Harry Potter shop at Heathrow airport), I started wondering about the reasons for Great Britain to become a culture so apt at storytelling - and growing into an empire. It’s just a hunch and completely void of reliable data, but I’d guess the ratio of money made by stories told divided by the number of people living in the country is even higher than for America. I’d also wager that a similar ratio holds true if you compare the British to the American empire (measured in people oppressed). Even if that’s not the case, it’s still an impressive feat for a comparatively small island to dominate the whole planet. What drove the British to achieve this? My hypothesis is: If you’re living on an island that is constantly covered in fog or rain clouds, you’ve got two options: - Stay indoors, evolve a culture around hot beverages and kill time by inventing and listening to stories. - Try to find a place with less rain and fog. And they did both. As mentioned above my approach is completely void of hard data. Plus it’s an ex-post explanation.  Still, you’ve got to admit: It sounds plausible, doesn’t it?</p>",
	"thumb_base64":"",
	"images_urls":[{"title":"Empires","w_190":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/9/Empires-w190.jpg","w_390":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/9/Empires-w390.jpg","w_800":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/9/Empires-w800.jpg","max_resolution":""}]
}