{
	"version":2,
	"filename":"index.html",
	"path_from_doc_root":"/blog/2019/2/8/london-transport/",
	"category":"blog post",
	"tags":[],
	"create_date":"2019-02-08",
	"title":"London Transport",
	"title_plain":"london-transport",
	"excerpt":"Today is the opening of the London Stories exposition in the London Transport Museum. Since one of my images is shown there, I am currently visiting this m ...",
	"content":"<a href=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/8/londonTransport.jpg\"><img src=\"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/8/londonTransport-w800.jpg\" width=\"800\"></a><p>Today is the opening of the London Stories exposition in the London Transport Museum. Since one of my images is shown there, I am currently visiting this marvelous city. The last time I’ve been here is over ten years ago. Well, a lot has changed. I can’t help but notice that the city starts to resemble the 2019 Los Angeles version shown in the original Blade Runner movie. The fashion worn on the streets still needs some iterations until it reaches the science fiction movies level of cool, but I’ve already seen some trends going in the right direction - e.g. people wearing jackets completely covered in some kind of metallic, reflecting material. London even has it’s own pyramid now, though it is much steeper than the building of the Tyrell Corporation in the movie. Walking through the streets, with the upcoming exposition in my mind, I started to wonder about the iconic busses. The need for a high throughput of people per unit of time is obvious: When I get out of the tube at Covent Garden and enter one of the four huge elevators, it’s almost like a drop ship scene in one of the alien movies and I can guess where the inspiration for stories like Mortal Engines came from. Still, the busses caught my special attention today. At home, in Wiesbaden, we’ve got busses that are extra long, with the problem of these busses being - of course - corners. That’s why these busses need a flexible part. I imagine this makes them extra hard to drive. Plus the cost for mechanical maintenance of the flexible part is substantial (at least I’d bet a beer, that this is the case) . Now compare this solution to the London busses: Simpler approach in terms of design and engineering, approximately the same carrying capacity (my uneducated estimation), lower mechanical maintenance cost (my guess, too) and reduced difficulty for the driver, probably making the training process simpler. Okay, you could run into problems when strong winds get one of the London busses from the flanks, but as long as they are driving through areas with buildings high enough to shield them from the wind, that won’t be dramatic. Nice transport solution, fitting for the city and adding to the touristic appeal of London. Works as designed.</p>",
	"thumb_base64":"",
	"images_urls":[{"title":"London Transport","w_190":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/8/londonTransport-w190.jpg","w_390":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/8/londonTransport-w390.jpg","w_800":"https://drewingde.s3.us-west-1.amazonaws.com/blog/2019/2/8/londonTransport-w800.jpg","max_resolution":""}]
}